duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
#if defined(SERIAL_RX_SPEKTRUM_1024)

#define MASK_1024_CHANID                                 0xFC00
#define MASK_1024_SXPOS                                  0x03FF
#define MAX_CHANNEL_COUNT                                7

#define DSM2_22MS                                        0x01                    // 1024
#define DSM2_11MS                                        0x12                    // 2048
#define DSMS_22MS                                        0xA2                    // 2048
#define DSMX_11MS                                        0xB2                    // 2048

#define SPEKTRUM_CHANNEL_THROTTLE                        0
#define SPEKTRUM_CHANNEL_AILERON                         1
#define SPEKTRUM_CHANNEL_ELEVATOR                        2
#define SPEKTRUM_CHANNEL_RUDDER                          3
#define SPEKTRUM_CHANNEL_GEAR                            4
#define SPEKTRUM_CHANNEL_AUX_1                           5
#define SPEKTRUM_CHANNEL_AUX_2                           6
#define SPEKTRUM_CHANNEL_AUX_3                           7
#define SPEKTRUM_CHANNEL_AUX_4                           8
#define SPEKTRUM_CHANNEL_AUX_5                           9
#define SPEKTRUM_CHANNEL_AUX_6                           10
#define SPEKTRUM_CHANNEL_AUX_7                           11

typedef struct
{
   uint8_t fades;
   uint8_t system;
   uint16_t channel[MAX_CHANNEL_COUNT];
} RX_PACKET_SPEKTRUM_1024;

#define RX_PACKET_SPEKTRUM_CHANNEL_ID_0                  0
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_1                  1
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_2                  2
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_3                  3
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_4                  4
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_5                  5
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_6                  6

uint8_t send_receiver_command()
{
   RX_PACKET_SPEKTRUM_1024 packet;
   memset(&packet, 0, sizeof(RX_PACKET_SPEKTRUM_1024));

   // missed frames for remote
   // always is null
   packet.fades                                          = 0;
   // type of receiver
   packet.system                                         = DSM2_22MS;

   // throttle (드론 상승, 하강)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_THROTTLE << 10))       |
                                                           (g_rx_channel[RX_CHANNEL_THROTTLE].value & MASK_1024_SXPOS);

   // Aileron (좌측 이동, 우측 이동)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_AILERON << 10))       |
                                                           (g_rx_channel[RX_CHANNEL_ROLL].value & MASK_1024_SXPOS);

   // Elevator (전진, 후진)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_ELEVATOR << 10))       |
                                                           (g_rx_channel[RX_CHANNEL_PITCH].value & MASK_1024_SXPOS);

   // Rudder (시계방향 회전, 반 시계방향 회전)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_RUDDER << 10))       |
                                                           (g_rx_channel[RX_CHANNEL_YAW].value & MASK_1024_SXPOS);

   // ADC 1
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_AUX_1 << 10));
   // ADC 2
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_AUX_2 << 10));
   // ADC 3
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_AUX_3 << 10));

   // fades
   while(app_uart_put(packet.fades) != NRF_SUCCESS);
   // system
   while(app_uart_put(packet.system) != NRF_SUCCESS);
   
   // throttle
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0] >> 8) & 0xFF)) != NRF_SUCCESS);
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]     ) & 0xFF)) != NRF_SUCCESS);

   // aileron
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1] >> 8) & 0xFF)) != NRF_SUCCESS);
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]     ) & 0xFF)) != NRF_SUCCESS);

   // aileron
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2] >> 8) & 0xFF)) != NRF_SUCCESS);
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]     ) & 0xFF)) != NRF_SUCCESS);

   // rudder
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3] >> 8) & 0xFF)) != NRF_SUCCESS);
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]     ) & 0xFF)) != NRF_SUCCESS);

   // adc 1
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4] >> 8) & 0xFF)) != NRF_SUCCESS);
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]     ) & 0xFF)) != NRF_SUCCESS);

   // adc 2
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5] >> 8) & 0xFF)) != NRF_SUCCESS);
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]     ) & 0xFF)) != NRF_SUCCESS);

   // adc 3
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6] >> 8) & 0xFF)) != NRF_SUCCESS);
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]     ) & 0xFF)) != NRF_SUCCESS);

   return 0;
}

#elif defined(SERIAL_RX_SPEKTRUM_2048)

#define DSM2_22MS                                        0x01                    // 1024
#define DSM2_11MS                                        0x12                    // 2048
#define DSMS_22MS                                        0xA2                    // 2048
#define DSMX_11MS                                        0xB2                    // 2048


uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_S_BUS)

