duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_SUMD)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_SUMH)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_MODE_B)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_MODE_B_BJ01)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_IBUS)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_MSP)

uint8_t send_receiver_command()
{
   return 0;
}

#else

uint8_t send_receiver_command()
{
   return 0;
}

#endif

static uint32_t g_prev_tick_count                        = 0;
static uint32_t g_update_tick_count                      = 0;
void serial_receiver_timer_handler(void * p_context)
{
   uint32_t cur_tick_count                               = 0;
   uint32_t diff_tick_count                              = 0;
   if (g_prev_tick_count == 0)
   {
      if (app_timer_cnt_get(&g_prev_tick_count) != NRF_SUCCESS)
      {
         printf("Can't get tick count \r\n");
      }
      return;
   }
   if (app_timer_cnt_get(&cur_tick_count) != NRF_SUCCESS)
   {
      printf("Can't get tick count \r\n");
      return;
   }

   if (app_timer_cnt_diff_compute(cur_tick_count, g_prev_tick_count, &diff_tick_count) != NRF_SUCCESS)
   {
      printf("Can't diff tick count \r\n");
      return;
   }
   g_prev_tick_count                                     = cur_tick_count;

   g_update_tick_count                                   += diff_tick_count;
   if (g_update_tick_count > SERIAL_RX_UPDATE_TICK_COUNT)
   {
      g_update_tick_count                                = 0;
      send_receiver_command();
   }
}

#endif   // SERIAL_RECEIVER

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#define CENTRAL_LINK_COUNT              0                                           /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1                                           /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define START_STRING                                     "Start...\r\n"

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  /**< Universally unique service identifier. */


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


